Repository: MichaelCamerlynck/tourcontrol
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr, nl

source: What We Do
fr: Ce Que Nous Faisons
nl: Wat Doen We

source: Our Story
fr: Notre Histoire
nl: Ons Verhaal

source: Contact Us
fr: Contactez-Nous
nl: Ons Contacteren

source: EMPOWERING DIGITAL VISIONS, EMBRACING COLLABORATION. LET'S IGNITE YOUR ONLINE JOURNEY. REACH OUT TODAY!
fr: RENFORCER LES VISIONS NUMÉRIQUES, EMBRASSER LA COLLABORATION. ALLUMONS VOTRE PARCOURS EN LIGNE. CONTACTEZ-NOUS AUJOURD'HUI !
nl: DIGITALE VISIES VERSTERKEN, SAMENWERKING OMARMEN. LATEN WE JOUW ONLINE REIS ONTSTEKEN. NEEM VANDAAG NOG CONTACT OP!

source: Name
fr: Nom
nl: Naam

source: Topic
fr: Sujet
nl: Onderwerp

source: Phone Number
fr: Numéro de téléphone
nl: Telefoonnummer

source: Message
nl: Bericht

source: submit
fr: Envoyer
nl: Verzenden

source: Message Sent!
fr: Message Envoyé !
nl: Bericht Verzonden

source: Message failed to send, please try again or contact us directly at INQUIRY@TOURCONTROL.AGENCY
fr: L'envoi du message a échoué, veuillez réessayer ou nous contacter directement à INQUIRY@TOURCONTROL.AGENCY
nl: Bericht kon niet worden verzonden, probeer het opnieuw of neem rechtstreeks contact met ons op via INQUIRY@TOURCONTROL.AGENCY

source: BUSINESS ENQUIRIES
fr: DEMANDES D'AFFAIRES
nl: ZAKELIJKE VRAGEN

source: unlock your
fr: DÉBLOQUEZ VOTRE
nl: ontgrendel je

source: perfect
fr: STRATÉGIE DE MARKETING
nl: perfecte

source: marketing strategy
fr: PARFAITE
nl: marketingstrategie

source: We help tailor you the solution for
fr: Nous vous aidons à adapter la solution
nl: Wij helpen u de oplossing op maat te maken

source: this new digital age
fr: à cette nouvelle ère numérique
nl: voor dit nieuwe digitale tijdperk

source: discover how we do it
fr: Découvrez Comment Nous Le Faisons
nl: Ontdek Hoe We Het Doen

source: Versitile
fr: Polyvalent
nl: Veelzijdig

source: Integrated
fr: Intégré
nl: Geïntegreerd

source: Empowered
fr: Habilité
nl: Bevoegd

source: At Tourcontrol, our expertise extends across companies of all sizes, each seeking innovative and competitive digital solutions. From small startups to established enterprises, we've honed our skills in crafting customized strategies that propel businesses forward in the modern and fast-paced market. Let us help you unlock your full digital potential and navigate the ever-changing digital landscape with confidence.
fr: Chez Tourcontrol, notre expertise s'étend à des entreprises de toutes tailles, cherchant chacune des solutions numériques innovantes et compétitives. Des petites startups aux entreprises établies, nous avons affiné nos compétences dans l'élaboration de stratégies personnalisées qui propulsent les entreprises en avant dans le marché moderne et rapide. Laissez-nous vous aider à libérer votre plein potentiel numérique et à naviguer avec confiance dans le paysage numérique en constante évolution.
nl: Bij Tourcontrol strekt onze expertise zich uit over bedrijven van alle groottes, die allemaal op zoek zijn naar innovatieve en competitieve digitale oplossingen. Van kleine startups tot gevestigde ondernemingen, hebben we onze vaardigheden verfijnd in het creëren van op maat gemaakte strategieën die bedrijven vooruit helpen in de moderne en snel veranderende markt. Laat ons u helpen om uw volledige digitale potentieel te benutten en met vertrouwen door het voortdurend veranderende digitale landschap te navigeren.

source: Explore the dynamic fusion of technologies, creative ideas, strategic concepts, and data-driven insights at Tourcontrol. Our innovative approach is designed to elevate your marketing campaigns to new heights. From refining your current strategies to developing a bespoke MarTech Core tailored to your unique business, we are dedicated to unleashing your brand's full potential. Experience the transformative power of seamless integration and unlock unprecedented success in the digital realm.
fr: Découvrez la fusion dynamique des technologies, des idées créatives, des concepts stratégiques et des perspectives basées sur les données chez Tourcontrol. Notre approche innovante est conçue pour élever vos campagnes marketing à de nouveaux sommets. De l'affinement de vos stratégies actuelles au développement d'un noyau MarTech sur mesure adapté à votre entreprise unique, nous sommes dévoués à libérer tout le potentiel de votre marque. Faites l'expérience du pouvoir transformateur de l'intégration fluide et débloquez un succès sans précédent dans le domaine numérique.
nl: Verken de dynamische samensmelting van technologieën, creatieve ideeën, strategische concepten en op data gebaseerde inzichten bij Tourcontrol. Onze innovatieve aanpak is ontworpen om je marketingcampagnes naar nieuwe hoogten te tillen. Van het verfijnen van je huidige strategieën tot het ontwikkelen van een op maat gemaakte MarTech Core die is afgestemd op jouw unieke bedrijf, wij zijn toegewijd om het volledige potentieel van je merk te ontketenen. Ervaar de transformerende kracht van naadloze integratie en ontgrendel ongekend succes in het digitale domein.

source: Step into the realm of limitless digital possibilities with Tourcontrol. Our expertise lies in crafting a robust and tailored media ecosystem that allows you to fully harness the power of modern digital marketing campaigns. Experience the transformative difference of our meticulous media setup and elevate your business to new heights in the digital landscape.
fr: Plongez dans le royaume des possibilités numériques illimitées avec Tourcontrol. Notre expertise réside dans la création d'un écosystème médiatique solide et personnalisé qui vous permet de tirer pleinement parti du pouvoir des campagnes modernes de marketing numérique. Faites l'expérience de la différence transformative de notre mise en place méticuleuse des médias et hissez votre entreprise vers de nouveaux sommets dans le paysage numérique.
nl: Betreed het domein van onbegrensde digitale mogelijkheden met Tourcontrol. Onze expertise ligt in het creëren van een krachtig en op maat gemaakt mediasysteem dat je in staat stelt om de volledige kracht van moderne digitale marketingcampagnes te benutten. Ervaar het transformerende verschil van onze nauwkeurige mediasystemen en til je bedrijf naar nieuwe hoogten in het digitale landschap.

source: Explore the dynamic fusion of technologies, creative ideas, strategic concepts, and data-driven insights at Tourcontrol. Our innovative approach is designed to elevate your marketing campaigns to new heights. From refining your current strategies to developing a bespoke MarTech Core tailored to your unique business, we are dedicated to unleashing your brand's full potential. Experience the transformative power of seamless integration and unlock unprecedented success in the digital realm.
fr: Découvrez la fusion dynamique des technologies, des idées créatives, des concepts stratégiques et des perspectives basées sur les données chez Tourcontrol. Notre approche innovante vise à élever vos campagnes marketing vers de nouveaux sommets. De l'affinage de vos stratégies actuelles au développement d'un noyau MarTech sur mesure conçu pour votre entreprise unique, nous sommes dévoués à libérer le plein potentiel de votre marque. Faites l'expérience du pouvoir transformateur de l'intégration fluide et déverrouillez un succès sans précédent dans le domaine numérique.
nl: Verken de dynamische samensmelting van technologieën, creatieve ideeën, strategische concepten en data-gedreven inzichten bij Tourcontrol. Onze innovatieve aanpak is ontworpen om je marketingcampagnes naar nieuwe hoogten te tillen. Van het verfijnen van je huidige strategieën tot het ontwikkelen van een op maat gemaakte MarTech Core die afgestemd is op je unieke bedrijf, wij zijn toegewijd om het volledige potentieel van je merk te ontketenen. Ervaar de transformerende kracht van naadloze integratie en ontgrendel ongekend succes in het digitale domein.

source: meet
nl: Ontmoet

source: the
nl: het

source: group
nl: groep

source: Meet the Team
fr: Rencontrez l'équipe
nl: Ontmoet het team

source: We have over <span class='font-bold text-[#ff5d5d]'>20 years</span> of growth marketing and strategy combined together
nl: Samen hebben we meer dan <span class='font-bold text-[#ff5d5d]'>20 jaar</span> aan groeimarketing en strategie

source: At Tour Control, we pride ourselves on empowering numerous corporate entities with our seasoned expertise, guiding them on their transformative journey towards digital relevance. We understand that embracing digitalization and establishing a robust MarTech Core may have seemed like an insurmountable challenge for many, but together, we turn the impossible into a reality.
fr: Chez Tour Control, nous sommes fiers d'autonomiser de nombreuses entités corporatives grâce à notre expertise éprouvée, les guidant dans leur voyage transformateur vers la pertinence numérique. Nous comprenons que l'adoption de la digitalisation et l'établissement d'un noyau MarTech solide peuvent sembler être un défi insurmontable pour beaucoup, mais ensemble, nous transformons l'impossible en réalité.
nl: Bij Tour Control zijn we er trots op talloze bedrijfsentiteiten te versterken met onze doorgewinterde expertise. We begeleiden ze op hun transformatieve reis naar digitale relevantie. We begrijpen dat het omarmen van digitalisering en het opzetten van een robuuste MarTech Core voor velen als een onoverkomelijke uitdaging kan hebben geleken, maar samen maken we het onmogelijke werkelijkheid.

source: Witness the
nl: Aanschouw de

source: Success
nl: succes

source: Stories
nl: verhalen

source: Companies that took the leap are not only surviving but thriving in today's dynamic business landscape. We take pride in motivating them to embrace the digital revolution, and they continue to stand strong.
fr: Les entreprises qui ont osé le saut ne survivent pas seulement, mais prospèrent dans le paysage commercial dynamique d'aujourd'hui. Nous sommes fiers de les avoir motivées à embrasser la révolution numérique, et elles continuent de rester solides.
nl: Bedrijven die de sprong hebben gewaagd, overleven niet alleen maar floreren in het dynamische zakelijke landschap van vandaag. We zijn er trots op hen te hebben gemotiveerd om de digitale revolutie te omarmen, en ze blijven standhouden.

source: Now, it's your turn to soar! Let's propel your business towards a brighter future by harnessing the power of digital transformation and unleashing its full potential. Don't miss this opportunity to thrive in the digital age - take that leap and secure your place among the digitally relevant elite.
fr: Maintenant, c'est à vous de briller ! Propulsons votre entreprise vers un avenir plus lumineux en exploitant le pouvoir de la transformation numérique et en libérant son plein potentiel. Ne manquez pas cette opportunité de prospérer à l'ère numérique - faites ce pas en avant et sécurisez votre place parmi l'élite numériquement pertinente.
nl: Nu is het jouw beurt om te schitteren! Laten we jouw bedrijf voortstuwen naar een helderdere toekomst door de kracht van digitale transformatie te benutten en het volledige potentieel ervan te ontketenen. Mis deze kans niet om te gedijen in het digitale tijdperk - waag die sprong en verzeker je plek bij de digitaal relevante elite.

source: start your
fr: Commencez votre parcours
nl: begin vandaag nog

source: digital journey
fr: numérique dès
nl: aan je digitale

source: today
fr: aujourd'hui
nl: reis

source: contact us
fr: Contactez-nous
nl: Contacteer ons

source: Home
fr: Accueil

source: Our Latest Thoughts on Things
fr: Nos Dernières Réflexions sur les Choses

source: We have over <span class='font-bold text-[#BE3455]'>20 years</span> of growth marketing and strategy combined together
fr: Nous cumulons plus de <span class='font-bold text-[#BE3455]'>20 ans</span> d'expérience en marketing de croissance et en stratégie
